; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 974174 1 1 3 3 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	spectrograph2 - mode
	spectrograph0 - mode
	infrared1 - mode
	Star1 - direction
	Star2 - direction
	GroundStation0 - direction
	Planet3 - direction
	Phenomenon4 - direction
	Star5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 spectrograph2)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
)
(:goal (and
	(pointing satellite0 Star6)
	(have_image Planet3 spectrograph2)
	(have_image Phenomenon4 infrared1)
	(have_image Star5 infrared1)
	(have_image Star6 spectrograph0)
	(have_image Phenomenon7 spectrograph0)
	(have_image Phenomenon8 spectrograph2)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
2. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 0 of 7
3. (turn_to satellite0 star6 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star6)
   goals met: 1 of 7
4. (take_image satellite0 star6 instrument0 spectrograph0)
   added: (have_image star6 spectrograph0)
   goals met: 2 of 7
5. (turn_to satellite0 star5 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star5)
   goals met: 1 of 7
6. (take_image satellite0 star5 instrument0 infrared1)
   added: (have_image star5 infrared1)
   goals met: 2 of 7
7. (turn_to satellite0 star6 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star6)
   goals met: 3 of 7
8. (turn_to satellite0 planet3 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet3)
   goals met: 2 of 7
9. (take_image satellite0 planet3 instrument0 spectrograph2)
   added: (have_image planet3 spectrograph2)
   goals met: 3 of 7
10. (turn_to satellite0 star6 planet3)
   deleted: (pointing satellite0 planet3)
   added: (pointing satellite0 star6)
   goals met: 4 of 7
11. (turn_to satellite0 phenomenon8 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 phenomenon8)
   goals met: 3 of 7
12. (take_image satellite0 phenomenon8 instrument0 spectrograph2)
   added: (have_image phenomenon8 spectrograph2)
   goals met: 4 of 7
13. (turn_to satellite0 star6 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 star6)
   goals met: 5 of 7
14. (turn_to satellite0 phenomenon7 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 phenomenon7)
   goals met: 4 of 7
15. (take_image satellite0 phenomenon7 instrument0 spectrograph0)
   added: (have_image phenomenon7 spectrograph0)
   goals met: 5 of 7
16. (turn_to satellite0 star6 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star6)
   goals met: 6 of 7
17. (turn_to satellite0 phenomenon4 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 phenomenon4)
   goals met: 5 of 7
18. (take_image satellite0 phenomenon4 instrument0 infrared1)
   added: (have_image phenomenon4 infrared1)
   goals met: 6 of 7
19. (turn_to satellite0 star6 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 star6)
   goals met: 7 of 7
